pabigot/FatFs/lpc23xx/main.c
			case 'j' :	/* fj <drive#> - Change current drive */
				if (!xatoi(&ptr, &p1)) break;
				put_rc(f_chdrive((BYTE)p1));
				break;
#if _FS_RPATH >= 2
			case 'q' :	/* fq - Show current dir path */
				res = f_getcwd(Line, sizeof Line);
				if (res)
					put_rc(res);
				else
					xprintf("%s\n", Line);
				break;
#endif
#endif
#if _USE_MKFS
			case 'm' :	/* fm <vol> <partition rule> <cluster size> - Create file system */
				if (!xatoi(&ptr, &p1) || !xatoi(&ptr, &p2) || !xatoi(&ptr, &p3)) break;
				xprintf("The volume will be formatted. Are you sure? (Y/n)=");
				xgets(ptr, sizeof Line);
				if (*ptr == 'Y')
					put_rc(f_mkfs((BYTE)p1, (BYTE)p2, (WORD)p3));
				break;
#endif
			case 'z' :	/* fz [<rw size>] - Change R/W length for fr/fw/fx command */
				if (xatoi(&ptr, &p1) && p1 >= 1 && (size_t)p1 <= sizeof Buff)
					blen = p1;
				xprintf("blen=%u\n", blen);
				break;
			}
			break;

		case 't' :	/* t [<year> <mon> <mday> <hour> <min> <sec>] */
			if (xatoi(&ptr, &p1)) {
				rtc.year = (WORD)p1;
				xatoi(&ptr, &p1); rtc.month = (BYTE)p1;
				xatoi(&ptr, &p1); rtc.mday = (BYTE)p1;
				xatoi(&ptr, &p1); rtc.hour = (BYTE)p1;
				xatoi(&ptr, &p1); rtc.min = (BYTE)p1;
				if (!xatoi(&ptr, &p1)) break;
				rtc.sec = (BYTE)p1;
				rtc_settime(&rtc);
			}
			rtc_gettime(&rtc);
			xprintf("%u/%u/%u %02u:%02u:%02u\n", rtc.year, rtc.month, rtc.mday, rtc.hour, rtc.min, rtc.sec);
			break;

		case '?' :	/* Show Command List */
			xprintf(
				"[Disk contorls]\n"
				" di <pd#> - Initialize disk\n"
				" dd [<pd#> <sect>] - Dump a secrtor\n"
				" ds <pd#> - Show disk status\n"
				" dcs <drv> - Issure CTRL_SYNC command\n"
				" dce <drv> <start> <end> - Issue CTRL_ERASE_SECTOR command\n"
				" dcf <drv> - Issure NAND_FORMAT command\n"
				"[Buffer controls]\n"
				" bd <ofs> - Dump working buffer\n"
				" be <ofs> [<data>] ... - Edit working buffer\n"
				" br <pd#> <sect> [<num>] - Read disk into working buffer\n"
				" bw <pd#> <sect> [<num>] - Write working buffer into disk\n"
				" bf <val> - Fill working buffer\n"
				"[File system controls]\n"
				" fi <ld#> - Force initialized the volume\n"
				" fs [<path>] - Show volume status\n"
				" fl [<path>] - Show a directory\n"
				" fo <mode> <file> - Open a file\n"
				" fc - Close the file\n"
				" fe <ofs> - Move fp in normal seek\n"
				" fd <len> - Read and dump the file\n"
				" fr <len> - Read the file\n"
				" fw <len> <val> - Write to the file\n"
				" fn <org.name> <new.name> - Rename an object\n"
				" fu <name> - Unlink an object\n"
				" fv - Truncate the file at current fp\n"
				" fk <name> - Create a directory\n"
				" fa <atrr> <mask> <name> - Change object attribute\n"
				" ft <yyyy> <mm> <dd> <hh> <mm> <ss> <name> - Change timestamp of an object\n"
				" fx <src.file> <dst.file> - Copy a file\n"
				" fg <path> - Change current directory\n"
				" fj <ld#> - Change current drive\n"
				" fq - Show current directory\n"
				" fm <ld#> <rule> <cluster size> - Create file system\n"
				"[Graphic commands]\n"
				" gi - Initialize display\n"
				" gk <l> <r> <t> <b> - Set active area\n"
				" gf <l> <r> <t> <b> <col> - Draw solid rectangular\n"
				" gm <x> <y> - Move current position\n"
				" gl <x> <y> <col> - Draw line to\n"
				" gp <x> <y> <col> - Draw single pixel\n"
				" gb <x> <y> - Put built-in bitmap\n"
				"[Misc commands]\n"
				" FD - Launch filer\n"
				" FL <file> - Launch file loader (bmp jpg img txt)\n"
				" md[b|h|w] <addr> [<count>] - Dump memory\n"
				" mf <addr> <value> <count> - Fill memory\n"
				" me[b|h|w] <addr> [<value> ...] - Edit memory\n"
				"\n"
			);
			break;
		}
	}
}

